configuration/src/Catalogs/ИнструментыСистемы/ИнструментыСистемы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИнструментыСистемы</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Добавить</name>
      <description>Добавить</description>
    </items>
    <items>
      <name>Закрепленные</name>
      <description>Закрепленные</description>
    </items>
    <items>
      <name>Контроль</name>
      <description>Контроль</description>
    </items>
    <items>
      <name>Мои</name>
      <description>Мои</description>
    </items>
    <items>
      <name>МоиНастройки</name>
      <description>Мои настройки</description>
    </items>
    <items>
      <name>НастройкаПроцессаФилиала</name>
      <description>Настройка процесса филиала</description>
    </items>
    <items>
      <name>Отчеты</name>
      <description>Отчеты</description>
    </items>
    <items>
      <name>Планирование</name>
      <description>Планирование</description>
    </items>
    <items>
      <name>Прочие</name>
      <description>Прочие</description>
    </items>
    <items>
      <name>СпискиДокументов</name>
      <description>Списки документов</description>
    </items>
    <items>
      <name>Трудозатраты</name>
      <description>Трудозатраты</description>
    </items>
    <items>
      <name>Управление</name>
      <description>Управление</description>
    </items>
    <items>
      <name>УправлениеУслугами</name>
      <description>Управление услугами</description>
    </items>
  </predefined>
  <attributes>
    <name>БыстрыйДоступ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьСчетчик</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Иконка</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяДляБыстрогоДоступа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МетодОпределенияДоступности</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МетодРасчетаСчетчика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектМетаданных</name>
    <type>
      <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
    </type>
  </attributes>
  <attributes>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

configuration/src/Catalogs/ИнструментыСистемы/Forms/ФормаЭлемента/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ОбновитьПредпросмотрИконки();
	
КонецПроцедуры

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.ЭтоГруппа Тогда
		Элементы.Родитель.Видимость = Ложь;
		Элементы.ВидОбъекта.Видимость = Ложь;
		Элементы.ГруппаПорядокБыстрыйДоступ.Видимость = Ложь;
		Элементы.ОбъектМетаданных.Видимость = Ложь;
	Иначе
		Элементы.ИмяДляБыстрогоДоступа.Доступность = Объект.БыстрыйДоступ;
	КонецЕсли;
	
	ЗаполнитьСписокВыбораВидовОбъекта(ЭтотОбъект, Ложь);
	ОбновитьПредпросмотрИконки();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ОбъектМетаданныхПриИзменении(Элемент)
	
	ЗаполнитьСписокВыбораВидовОбъекта(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьСписокВыбораВидовОбъекта(Форма, Знач ИзменениеОбъекта = Истина)
	
	Форма.Элементы.ВидОбъекта.СписокВыбора.Очистить();
	
	Если ЗначениеЗаполнено(Форма.Объект.ОбъектМетаданных) Тогда
		ВидыОбъектов = ПолучитьВидыОбъектаМетаданных(Форма.Объект.ОбъектМетаданных);
		
		Для Каждого ВидОбъекта Из ВидыОбъектов Цикл
			Форма.Элементы.ВидОбъекта.СписокВыбора.Добавить(ВидОбъекта.Значение, ВидОбъекта.Представление);
		КонецЦикла;
		
		Если ИзменениеОбъекта И ВидыОбъектов.НайтиПоЗначению(Форма.Объект.ВидОбъекта) = Неопределено Тогда
			Форма.Объект.ВидОбъекта = ВидыОбъектов[0].Значение;
		КонецЕсли;
	Иначе
		Форма.Объект.ВидОбъекта = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПредпросмотрИконки()
	
	Если ЗначениеЗаполнено(Объект.Иконка) Тогда
		МакетИконки = Справочники.ИнструментыСистемы.ПолучитьМакет("Иконка").ПолучитьТекст();
		ПредпросмотрИконки = СтрШаблон(МакетИконки, Объект.Иконка);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьВидыОбъектаМетаданных(Знач ОбъектМетаданных)
	
	Возврат Справочники.ИнструментыСистемы.ПолучитьВидыОбъектаМетаданных(ОбъектМетаданных);
	
КонецФункции

&НаКлиенте
Процедура БыстрыйДоступПриИзменении(Элемент)
	
	Элементы.ИмяДляБыстрогоДоступа.Доступность = Объект.БыстрыйДоступ;
	
КонецПроцедуры

#КонецОбласти
